[
  {
    "id": 1,
    "img": "https://i.ibb.co.com/rfF5PjqC/silent-forest.jpg",
    "title": "The Silent Forest",
    "hashtag": ["#YoungAdult", "#Identity"],
    "author": "By: Emma Collins",
    "category": "Fiction",
    "rating": 4.6,
    "review": "The Silent Forest is a captivating journey into the mind of a young adult searching for identity and purpose. The characters are deeply relatable, and the story unfolds with surprising twists that keep you engaged. The emotional depth is remarkable, and it beautifully captures the struggles and triumphs of growing up. A perfect read for anyone who enjoys introspective fiction with a heartwarming touch.",
    "pages": 320,
    "publisher": "Penguin Books",
    "year": 2021
  },
  {
    "id": 2,
    "img": "https://i.ibb.co.com/b5n82rGF/chashing-tomorrow.jpg",
    "title": "Chasing Tomorrow",
    "hashtag": ["#Motivation", "#SelfGrowth"],
    "author": "By: Daniel Wright",
    "category": "Non-Fiction",
    "rating": 4.4,
    "review": "Chasing Tomorrow is an inspiring book that motivates readers to embrace change and personal growth. The author provides practical advice while sharing real-life experiences, making the lessons relatable and actionable. Every chapter offers insights that encourage reflection and forward-thinking. It's an essential read for anyone striving to unlock their potential and build a better future. Truly a guidebook for self-improvement.",
    "pages": 280,
    "publisher": "HarperCollins",
    "year": 2020
  },
  {
    "id": 3,
    "img": "https://i.ibb.co.com/XZ5GPfQD/Echoes-of-the-past.jpg",
    "title": "Echoes of the Past",
    "hashtag": ["#History", "#War"],
    "author": "By: Olivia Brown",
    "category": "Historical Fiction",
    "rating": 4.7,
    "review": "Echoes of the Past masterfully brings history to life, blending fact with immersive storytelling. The characters are vivid, and the settings feel authentic, transporting readers to a different era. The narrative explores the complexities of war, human resilience, and moral dilemmas. It's a compelling read that educates as much as it entertains. The pacing and plot twists keep you hooked from beginning to end.",
    "pages": 410,
    "publisher": "Oxford Press",
    "year": 2019
  },
  {
    "id": 4,
    "img": "https://i.ibb.co.com/TMFYKVSH/mind-over-matter.jpg",
    "title": "Mind Over Matter",
    "hashtag": ["#Psychology", "#MentalHealth"],
    "author": "By: Dr. Steven Hall",
    "category": "Self-Help",
    "rating": 4.5,
    "review": "Mind Over Matter is a powerful guide to understanding and strengthening your mindset. The author breaks down complex psychological concepts into practical strategies that anyone can follow. Each chapter offers exercises and real-life examples that encourage reflection and self-awareness. This book is both informative and inspiring, providing tools to overcome obstacles and improve mental well-being. A must-read for those seeking personal transformation.",
    "pages": 260,
    "publisher": "Simon & Schuster",
    "year": 2022
  },
  {
    "id": 5,
    "img": "https://i.ibb.co.com/r2Mr7xZJ/starts-Beyond-Reach.avif",
    "title": "Stars Beyond Reach",
    "hashtag": ["#SciFi", "#Adventure"],
    "author": "By: Lucas Reed",
    "category": "Science Fiction",
    "rating": 4.8,
    "review": "Stars Beyond Reach is a thrilling science fiction adventure that pushes the boundaries of imagination. The story is fast-paced, with intriguing characters and unexpected plot twists. The author creates a believable futuristic world with advanced technology and interstellar travel. Every page is filled with suspense, action, and thought-provoking ideas about humanity's place in the universe. It's a must-read for any sci-fi enthusiast looking for excitement and depth.",
    "pages": 390,
    "publisher": "Tor Books",
    "year": 2023
  },
  {
    "id": 6,
    "img": "https://i.ibb.co.com/XfXg78vP/love-in-autmn.jpg",
    "title": "Love in Autumn",
    "hashtag": ["#Romance", "#Drama"],
    "author": "By: Sophia Martinez",
    "category": "Romance",
    "rating": 4.3,
    "review": "Love in Autumn is a beautifully written romance that captures the complexities of love, loss, and hope. The emotions are raw and realistic, making it easy to connect with the characters. The narrative flows gracefully, with tender moments balanced by challenges that test the bonds of love. It's a story that lingers long after the last page, reminding readers of the transformative power of human connection. A heartfelt and emotional journey.",
    "pages": 300,
    "publisher": "Bloomsbury",
    "year": 2018
  },
  {
    "id": 7,
    "img": "https://i.ibb.co.com/VYCBBtm8/the-coding-mind.png",
    "title": "The Coding Mind",
    "hashtag": ["#Technology", "#Programming"],
    "author": "By: Alex Turner",
    "category": "Education",
    "rating": 4.9,
    "review": "The Coding Mind is an excellent guide for programmers and tech enthusiasts alike. It explains complex coding concepts in an easy-to-understand way, making learning both fun and effective. The examples are practical, and the exercises encourage hands-on experience. Beyond coding, the book also explores the mindset needed for problem-solving and creative thinking. It's a must-have resource for anyone serious about improving their programming skills.",
    "pages": 520,
    "publisher": "O'Reilly Media",
    "year": 2024
  },
  {
    "id": 8,
    "img": "https://i.ibb.co.com/C5PzCJ4G/hiddentruith.jpg",
    "title": "Hidden Truths",
    "hashtag": ["#Thriller", "#Mystery"],
    "author": "By: Rachel Adams",
    "category": "Mystery",
    "rating": 4.6,
    "review": "Hidden Truths is a gripping mystery thriller that keeps readers on the edge of their seats. The plot is full of suspense, twists, and red herrings that make guessing the ending nearly impossible. Characters are well-developed, each with secrets that add depth to the story. The pacing is perfect, balancing intense moments with quieter, introspective scenes. A must-read for anyone who loves a clever, engaging whodunit.",
    "pages": 350,
    "publisher": "Macmillan",
    "year": 2021
  },
  {
    "id": 9,
    "img": "https://i.ibb.co.com/ZzmhLdRq/art-of-leadership.jpg",
    "title": "The Art of Leadership",
    "hashtag": ["#Business", "#Leadership"],
    "author": "By: Michael Grant",
    "category": "Business",
    "rating": 4.5,
    "review": "The Art of Leadership is a comprehensive guide to becoming an effective and inspiring leader. The author shares practical strategies supported by real-world examples. Each chapter focuses on developing key skills, from communication to decision-making, while highlighting common leadership challenges. It's both motivational and actionable, providing readers with tools to grow personally and professionally. A valuable resource for aspiring leaders in any field.",
    "pages": 290,
    "publisher": "Pearson",
    "year": 2019
  },
  {
    "id": 10,
    "img": "https://i.ibb.co.com/Nv0FgRJ/winds-of-freedom.jpg",
    "title": "Winds of Freedom",
    "hashtag": ["#YoungAdult", "#Adventure"],
    "author": "By: Noah Wilson",
    "category": "Adventure",
    "rating": 4.7,
    "review": "Winds of Freedom is an exhilarating adventure novel that explores courage, independence, and discovery. The protagonist's journey is filled with challenges that test resilience and morality. The storytelling is vivid, with rich descriptions of landscapes and thrilling action sequences. Readers are drawn into a world of adventure that balances excitement with meaningful life lessons. A perfect pick for young adults seeking inspiration and excitement.",
    "pages": 340,
    "publisher": "Scholastic",
    "year": 2020
  }
]
